# FabricationProductDataSizeDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationProductDataSizeDescription Property
ParameterTypeId Class See Also
---
"Product Size Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationProductDataSizeDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationProductDataSizeDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationProductDataSizeDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace